from time import sleep
def protss(prots):
    while prots <= 100:
        print("загрузка...", prots, "%...")
        prots = prots + 20
        sleep(1)
    print("Пользователю ", name , "успешно взломали жопу\n"
                                  "⠄⢀⣀⣠⣤⣴⣶⣶⡇⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄"
"⢰⣿⣿⣿⣿⣿⣿⣿⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄\n"
"⢸⣿⣿⣿⣿⣿⣿⣿⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⢀⣀⣀⣀⡀⠄⠄\n"
"⢸⣿⣿⣿⣿⡿⢿⣿⣤⡀⠄⠄⠄⠄⠄⠄⠄⣠⠴⠚⠋⠉⠉⠉⠙⠂⠄\n"
"⢸⣿⣿⣿⠷⢶⣶⣶⣾⣭⣓⠦⠄⠄⠄⠄⠈⣀⣴⣶⣿⠿⠿⠛⠛⠶⣄\n"
"⢸⣿⣿⣇⠄⠄⠄⠈⠙⠻⣿⣷⠄⠄⠄⠄⠸⢿⠟⠉⠄⠄⠄⠄⠄⠄⠄\n"
"⢸⣿⣿⣿⡄⠄⠄⠄⠄⠄⠈⢻⣦⠄⠄⠄⠰⠃⠄⠄⠄⠄⠄⠄⠄⠄⣠\n"
"⢸⣿⡿⠛⠿⠿⠿⠿⠿⢗⣿⣿⣿⣇⠄⠄⠄⠄⠄⠰⠶⠿⠿⠿⠟⠚⠯\n"
"⠄⣿⠄⠄⠄⠄⠄⠄⠄⠁⣾⣿⣿⣿⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄\n"
"⠄⣿⠄⠄⠄⠄⠄⠄⠄⣰⣿⣿⣿⣿⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄\n"
"⠄⣿⠄⠄⠄⠄⠄⠄⢠⣿⣿⣿⣿⡏⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄\n"
"⠄⢹⡦⢄⣀⣠⣤⠖⠛⠛⠿⣿⣿⡅⠄⠄⢀⣀⠄⠄⠈⠓⠦⣄⣀⣠⠄\n"
"⠄⠘⣿⡀⢹⡿⣧⡀⠄⠄⠄⠈⣹⣿⣶⣾⣧⡀⠄⠄⠄⢀⣠⡾⢡⠏\n"
"⠄⠄⠹⣷⠈⣷⡙⢿⣷⣶⣶⣾⣿⠟⠁⠻⣿⣿⣶⣶⣶⡿⠟⢀⡾\n"
"⠄⠄⠄⠹⣧⡘⢷⡀⠄⠄⠄⠠⠤⠤⠤⠤⠤⠄⠄⠄⠄⠄⢠⡞\n"
"⠄⠄⠄⠄⠘⢷⡌⠳⡀⠄⠄⠄⠠⣤⣤⣤⡤⠄⠄⠄⠄⣰⠋\n"
"⠄⠄⠄⠄⠄⠄⠻⣆⠙⡄⠄⠄⠄⠈⣿⣿⠁⠄⠄⠄⠔⠁\n"
"⠄⠄⠄⠄⠄⠄⠄⠘⢧⡈⠂⠄⠄⢰⣿⣿⡆⠄⠄⠄\n"
"⠄⠄⠄⠄⠄⠄⠄⠄⠄⠻⣄⠄⠄⠸⣿⣿⡇⠄\n"
"⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠈⠂⠄⠄⣿⣿⠁\n"
"⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠸⠇\n"
)

name = input("Введите имя пользователя, которого надо взломать:\n"
             "1. Нұрлан\n"
             "2. OSobaMask\n"
             "3. Pipa\n"
             "4. SersonXL\n"
             "5. XХХ Ivan Darkholme\n"
             "6. Andr\n"
             "7.Pizzaiolianio\n ")
if name == "Нұрлан":
    print("Производится взлом жопы, подождите")
    sleep(1)
    protss(0)
    sleep(1)

if name == "OSobaMask":
    print("Производится взлом жопы, подождите")
    sleep(1)
    protss(0)
    sleep(1)
if name == "Pipa":
    print("Производится взлом жопы, подождите")
    sleep(1)
    protss(0)
    sleep(1)
if name == "SersonXL":
    print("Взлом не удался, слишком жесткая защита")

if name == "XХХ Ivan Darkholme":
    print("Производится взлом жопы, подождите")
    sleep(1)
    protss(0)
    sleep(1)
if name == "Andr":
    print("Производится взлом жопы, подождите")
    sleep(1)
    protss(0)
    sleep(1)
if name == "Pizzaiolianio":
    print("Производится взлом жопы, подождите")
    sleep(1)
    protss(0)
    sleep(1)


