"""

Задание 3 Калькулятор секунд

Реализовать вывод информации о промежутке времени в зависимости от его
продолжительности duration в секундах:
<d> дн <h> час <m> мин <s> сек.
Примечание! Пользоваться циклами запрещено.
Примеры:

duration = 53
53 сек
duration = 153
2 мин 33 сек
duration = 4153
1 час 9 мин 13 сек
duration = 400153
4 дн 15 час 9 мин 13 сек
"""
duration = int(input('введите число '))
d = duration// 86400
h = duration // 3600 % 24
m = duration // 60 % 60
s = duration % 60

print(d, 'дн', h, 'час', m, 'мин', s, 'сек')


